[ItemDefs.ID_dlc4_Armoury_Hidden_Switch ItemDefinition]
ItemName="Claptrap repair kit"
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_Armoury_Hidden_Switch:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="This looks like it might have what you need to repair the claptrap."
NoConstraintText=""
Suffix=""

[ItemDefs.ID_dlc4_Claptrap_Repair_Kit ItemDefinition]
ItemName="Claptrap repair kit"
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_Claptrap_Repair_Kit:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="This looks like it might have what you need to repair the claptrap."
NoConstraintText=""
Suffix=""

[ItemDefs.ID_dlc4_FoodChute ItemDefinition]
ItemName=""
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_FoodChute:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Food Delivery Chute"
NoConstraintText=""
Suffix=""

[ItemDefs.ID_dlc4_Garbage ItemDefinition]
ItemName="Tasty garbage"
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_Garbage:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A pile of rotting food and sparkling debris."
NoConstraintText=""
Suffix=""

[ItemDefs.ID_dlc4_Spa_Power_Source ItemDefinition]
ItemName="Spa Power Source"
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_Spa_Power_Source:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A small cold fusion power source."
NoConstraintText=""
Suffix=""

[ItemDefs.ID_dlc4_Turret_Components ItemDefinition]
ItemName="Turret component"
NoManufacturerName="Generic"
PickupMessage="You got %s"
PickupMessageWithLevel="You got %s (Level %d)"
UseFailureCharacterMessage="You must be a %s to use this item."
UseFailureConstraintsMessage="You cannot use this item."
UseFailureLevelMessage="You must be at least level %d to use this item."

[ItemDefs.ID_dlc4_Turret_Components:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="A turret fire control coupling spanner device mark-4, that's what it says on the label."
NoConstraintText=""
Suffix=""

